/* 7) *Сравнить null и 0. Попробуйте объяснить результат. 
Изучалось вот здесь  https://habr.com/ru/company/ruvds/blog/337732/. До конца не понял. Из того, как мне кажется, что понял: Null - имеет такое философское значение, отсутствие объекта,   а "0" - математический физический ноль.   */

/*8) *С помощью рекурсии организовать функцию возведения числа в степень. Формат: function power(val, pow), где val – заданное число, pow – степень. 
Рекурсию понимаю, но на практике теряюсь, не получется пока использовать. Изучаю*/

